enum CAR_SLOT_ID {
	CARSLOTID_BASE = 0,
	CARSLOTID_DAMAGE_FRONT_WINDOW = 1,
	CARSLOTID_DAMAGE_BODY = 2,
	CARSLOTID_DAMAGE_COP_LIGHTS = 3,
	CARSLOTID_DAMAGE_COP_SPOILER = 4,
	CARSLOTID_DAMAGE_FRONT_WHEEL = 5,
	CARSLOTID_DAMAGE_LEFT_BRAKELIGHT = 6,
	CARSLOTID_DAMAGE_RIGHT_BRAKELIGHT = 7,
	CARSLOTID_DAMAGE_LEFT_HEADLIGHT = 8,
	CARSLOTID_DAMAGE_RIGHT_HEADLIGHT = 9,
	CARSLOTID_DAMAGE_HOOD = 10,
	CARSLOTID_DAMAGE_BUSHGUARD = 11,
	CARSLOTID_DAMAGE_FRONT_BUMPER = 12,
	CARSLOTID_DAMAGE_RIGHT_DOOR = 13,
	CARSLOTID_DAMAGE_RIGHT_REAR_DOOR = 14,
	CARSLOTID_DAMAGE_TRUNK = 15,
	CARSLOTID_DAMAGE_REAR_BUMPER = 16,
	CARSLOTID_DAMAGE_REAR_LEFT_WINDOW = 17,
	CARSLOTID_DAMAGE_FRONT_LEFT_WINDOW = 18,
	CARSLOTID_DAMAGE_FRONT_RIGHT_WINDOW = 19,
	CARSLOTID_DAMAGE_REAR_RIGHT_WINDOW = 20,
	CARSLOTID_DAMAGE_LEFT_DOOR = 21,
	CARSLOTID_DAMAGE_LEFT_REAR_DOOR = 22,
	CARSLOTID_BODY = 23,
	CARSLOTID_FRONT_BRAKE = 24,
	CARSLOTID_FRONT_ROTOR = 25,
	CARSLOTID_FRONT_LEFT_WINDOW = 26,
	CARSLOTID_FRONT_RIGHT_WINDOW = 27,
	CARSLOTID_FRONT_WINDOW = 28,
	CARSLOTID_INTERIOR = 29,
	CARSLOTID_LEFT_BRAKELIGHT = 30,
	CARSLOTID_LEFT_BRAKELIGHT_GLASS = 31,
	CARSLOTID_LEFT_HEADLIGHT = 32,
	CARSLOTID_LEFT_HEADLIGHT_GLASS = 33,
	CARSLOTID_LEFT_SIDE_MIRROR = 34,
	CARSLOTID_REAR_BRAKE = 35,
	CARSLOTID_REAR_ROTOR = 36,
	CARSLOTID_REAR_LEFT_WINDOW = 37,
	CARSLOTID_REAR_RIGHT_WINDOW = 38,
	CARSLOTID_REAR_WINDOW = 39,
	CARSLOTID_RIGHT_BRAKELIGHT = 40,
	CARSLOTID_RIGHT_BRAKELIGHT_GLASS = 41,
	CARSLOTID_RIGHT_HEADLIGHT = 42,
	CARSLOTID_RIGHT_HEADLIGHT_GLASS = 43,
	CARSLOTID_RIGHT_SIDE_MIRROR = 44,
	CARSLOTID_DRIVER = 45,
	CARSLOTID_STEERINGWHEEL = 46,
	CARSLOTID_EXHAUST = 47,
	CARSLOTID_SPOILER = 48,
	CARSLOTID_UNIVERSAL_SPOILER_BASE = 49,
	CARSLOTID_DAMAGE0_FRONT = 50,
	CARSLOTID_DAMAGE0_FRONTLEFT = 51,
	CARSLOTID_DAMAGE0_FRONTRIGHT = 52,
	CARSLOTID_DAMAGE0_REAR = 53,
	CARSLOTID_DAMAGE0_REARLEFT = 54,
	CARSLOTID_DAMAGE0_REARRIGHT = 55,
	CARSLOTID_ATTACHMENT0 = 56,
	CARSLOTID_ATTACHMENT1 = 57,
	CARSLOTID_ATTACHMENT2 = 58,
	CARSLOTID_ATTACHMENT3 = 59,
	CARSLOTID_ATTACHMENT4 = 60,
	CARSLOTID_ATTACHMENT5 = 61,
	CARSLOTID_ATTACHMENT6 = 62,
	CARSLOTID_ATTACHMENT7 = 63,
	CARSLOTID_ATTACHMENT8 = 64,
	CARSLOTID_ATTACHMENT9 = 65,
	CARSLOTID_ATTACHMENT10 = 66,
	CARSLOTID_ATTACHMENT11 = 67,
	CARSLOTID_ATTACHMENT12 = 68,
	CARSLOTID_ATTACHMENT13 = 69,
	CARSLOTID_ATTACHMENT14 = 70,
	CARSLOTID_ATTACHMENT15 = 71,
	CARSLOTID_FRONT_BUMPER = 72,
	CARSLOTID_FRONT_BUMPER_BADGING_SET = 73,
	CARSLOTID_REAR_BUMPER = 74,
	CARSLOTID_REAR_BUMPER_BADGING_SET = 75,
	CARSLOTID_ROOF = 76,
	CARSLOTID_ROOF_SCOOP = 77,
	CARSLOTID_HOOD = 78,
	CARSLOTID_SKIRT = 79,
	CARSLOTID_HEADLIGHT = 80,
	CARSLOTID_BRAKELIGHT = 81,
	CARSLOTID_DOOR_LEFT = 82,
	CARSLOTID_DOOR_RIGHT = 83,
	CARSLOTID_BRAKE = 84,
	CARSLOTID_WHEEL = 85,
	CARSLOTID_LICENSE_PLATE = 86,
	CARSLOTID_BODY_DOORLINE = 87,
	CARSLOTID_DECAL_FRONT_WINDOW = 88,
	CARSLOTID_DECAL_REAR_WINDOW = 89,
	CARSLOTID_PAINT = 90,
	CARSLOTID_PAINT_GROUP = 91,
	CARSLOTID_PAINT_SWATCH = 92,
	CARSLOTID_VINYL_PAINT = 93,
	CARSLOTID_RIM_PAINT = 94,
	CARSLOTID_WHEEL_PAINT_GROUP = 95,
	CARSLOTID_DECAL_TEXTURE = 96,
	CARSLOTID_VINYL_SPECIFIC = 97,
	CARSLOTID_VINYL_GENERIC = 98,
	CARSLOTID_VECTORVINYL = 99,
	CARSLOTID_WINDOW_TINT = 100,
	CARSLOTID_CUSTOM_HUD = 101,
	CARSLOTID_CV = 102,
	CARSLOTID_MISC = 103,
	CARSLOTID_NUM = 106,
};

class CarPartIDNameMap {
public:
	int CarPartID;
	const char* Name;
	UCrc32 Crc;
};
auto CarPartIDNames = (CarPartIDNameMap*)0xA7A5E8;

namespace VinylSystem {
	class VinylTransformPacked {
	public:
		int16_t translationX;
		int16_t translationY;
		uint8_t rotation;
		uint8_t scaleX;
		uint8_t scaleY;
		uint8_t shear : 7;
		uint8_t proportionalScale : 1;
	};
}

class VinylColor {
public:
	unsigned int huePartNameHash;
	uint8_t saturation;
	uint8_t brightness;
};

class VinylLayer {
public:
	unsigned int vinylPartNameHash;
	VinylSystem::VinylTransformPacked transform;
	VinylColor colors[4];
};
static_assert(sizeof(VinylLayer) == 0x2C);

class DBCarPart;
class CarPaintPartRecord {
public:
	DBCarPart* paint_group;
	DBCarPart* baseHue;
	float saturation;
	float variance;
};
static_assert(sizeof(CarPaintPartRecord) == 0x10);

class PresetCar : public bTNode<PresetCar> {
public:
	char CarTypeName[32];
	char PresetName[32];
	uint64_t FEKey;
	uint64_t VehicleKey;
	uint32_t FilterBits;
	int PhysicsLevel;
	uint32_t PartNameHashes[CARSLOTID_NUM];
	char customPaintsValid[2];
	CarPaintPartRecord customPaints[2];
	uint8_t AutosculptPoseValues[9][11];
	VinylLayer VinylLayers[20];
};
static_assert(sizeof(PresetCar) == 0x600);
static_assert(offsetof(PresetCar, PresetName) == 0x28);
static_assert(offsetof(PresetCar, FEKey) == 0x48);
static_assert(offsetof(PresetCar, VehicleKey) == 0x50);
static_assert(offsetof(PresetCar, FilterBits) == 0x58);
static_assert(offsetof(PresetCar, PartNameHashes) == 0x60);
static_assert(offsetof(PresetCar, customPaintsValid) == 0x208);
static_assert(offsetof(PresetCar, customPaints) == 0x20C);
static_assert(offsetof(PresetCar, AutosculptPoseValues) == 0x22C);
static_assert(offsetof(PresetCar, VinylLayers) == 0x290);
auto& PresetCarList = *(bList<PresetCar>*)0xB77004;

auto FindFEPresetCar = (PresetCar*(*)(uint32_t))0x7C3050;